{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 50], "name": "input_1", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_dim": 10, "input_dim": 45, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "input_length": 50, "dtype": "float32", "batch_input_shape": [null, 50], "name": "embedding_1", "embeddings_regularizer": null, "trainable": true, "activity_regularizer": null, "mask_zero": false, "embeddings_constraint": null}, "class_name": "Embedding"}, {"name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "implementation": 1, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "units": 64, "dropout": 0.0, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "return_state": false, "kernel_regularizer": null, "use_bias": true, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "trainable": true, "stateful": false, "bias_regularizer": null, "bias_constraint": null}, "class_name": "LSTM"}, {"name": "dense_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 5, "bias_constraint": null}, "class_name": "Dense"}]}, "keras_version": "2.2.0", "class_name": "Model"}