{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.0", "config": {"name": "model_2", "layers": [{"name": "input_2", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 50, 45]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "lstm_2", "config": {"name": "lstm_2", "bias_regularizer": null, "dropout": 0.0, "return_sequences": false, "activation": "tanh", "recurrent_dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "unroll": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_regularizer": null, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "units": 128, "recurrent_constraint": null, "implementation": 1}, "class_name": "LSTM", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_2", "config": {"name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "use_bias": true, "units": 5, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}